<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"62fb8a00e10888419bb4e74f776330cfff4988650d99029d78819c4b1bca93df","plan_job_ref":"Job Test actions using target and replace #508 at https://github.com/dflook/terraform-github-actions/actions/runs/15362625723","plan_out_hash":"ff616174397a60d48dff14d1289c9d454abfd348acbce34d832641d10afd6f2f","plan_hash":"a19ec670f67b98428bc2eddc6d1c9cfa65325d5a28fd2f6be43586ecd0c22d4e","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "U3RTaXgc6c" -> (known after apply)
!~  foreach = "xiYPNIWWAv" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #508](https://github.com/dflook/terraform-github-actions/actions/runs/15362625723)